In [1]:
import pandas as pd

In [2]:
fields=['Sexo Trabalhador','CNAE 2.0 Classe','Vl Remun Média Nom']
fieldsnum = [37,8,34]

In [3]:
df_norte = pd.read_csv("RAIS_VINC_PUB_NORTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [4]:
df_norte=df_norte.loc[df_norte['CNAE 2.0 Classe']==62040]

In [6]:
df_norte.shape

(1581, 3)

In [7]:
df_norte['valor'] = df_norte['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )

In [11]:
df_norte.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [12]:
df_norte

         Sexo Trabalhador    valor
20975                   1   846.45
56525                   1  1039.13
78738                   1  1711.66
78739                   1  1800.00
120659                  2  1711.11
...                   ...      ...
3639886                 2  1765.18
3657918                 2  1156.00
3667643                 2  6421.07
3697009                 2  5047.30
3697010                 2  5301.89

[1581 rows x 2 columns]

In [16]:
df_nordeste = pd.read_csv("RAIS_VINC_PUB_NORDESTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fieldsnum,header=None)

In [21]:
df_nordeste.head()

      8              34  37
0  14134  0000001170,76   2
1  49302  0000001919,11   2
2  49302  0000001575,90   2
3  47717  0000002655,65   2
4  47717  0000002233,82   2

In [23]:
df_nordeste= df_nordeste.loc[df_nordeste[8]==62040]

In [24]:
df_nordeste['valor'] = df_nordeste[34].map(lambda x: round(float(x.replace(',','.')),2)    )

C:\Users\014207~1\AppData\Local\Temp/ipykernel_9840/4162468604.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_nordeste['valor'] = df_nordeste[34].map(lambda x: round(float(x.replace(',','.')),2)    )

In [26]:
df_nordeste.drop([8,34], axis=1,inplace=True)

C:\Users\014207631\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [27]:
df_nordeste

          37     valor
13505      2   2000.00
18228      2   1300.00
48504      2   1100.00
62297      2   1287.41
67347      2   5936.43
...       ..       ...
10550819   2   8577.25
10550820   2   8768.89
10550821   2   9133.86
10551675   2   8672.85
10555961   2  10671.92

[23174 rows x 2 columns]

In [30]:
df_nordeste = df_nordeste.rename(columns = {37: "Sexo Trabalhador"})

In [33]:
df_nordeste

          Sexo Trabalhador     valor
13505                    2   2000.00
18228                    2   1300.00
48504                    2   1100.00
62297                    2   1287.41
67347                    2   5936.43
...                    ...       ...
10550819                 2   8577.25
10550820                 2   8768.89
10550821                 2   9133.86
10551675                 2   8672.85
10555961                 2  10671.92

[23174 rows x 2 columns]

In [34]:
df_centro = pd.read_csv("RAIS_VINC_PUB_CENTRO_OESTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [35]:
df_centro

         CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   2209      0000001113,46                 1
1                  41107      0000001100,00                 1
2                  16102      0000001121,00                 1
3                  10651      0000002092,57                 1
4                  22226      0000001722,74                 1
...                  ...                ...               ...
6161933            86402      0000011214,70                 2
6161934            94995      0000013645,18                 2
6161935            94995      0000010619,59                 2
6161936            86402      0000008675,59                 2
6161937            94201      0000011995,82                 2

[6161938 rows x 3 columns]

In [38]:
df_centro=df_centro.loc[df_centro['CNAE 2.0 Classe']==62040]

In [39]:
df_centro['valor'] = df_centro['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )

C:\Users\014207~1\AppData\Local\Temp/ipykernel_9840/635063920.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_centro['valor'] = df_centro['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )

In [40]:
df_centro

         CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador     valor
77037              62040      0000000800,00                 1    800.00
78970              62040      0000001118,98                 1   1118.98
79752              62040      0000000634,67                 1    634.67
85003              62040      0000001441,19                 1   1441.19
85004              62040      0000001160,00                 1   1160.00
...                  ...                ...               ...       ...
6158301            62040      0000003186,62                 2   3186.62
6158512            62040      0000004617,97                 2   4617.97
6161667            62040      0000009000,00                 2   9000.00
6161812            62040      0000014128,08                 2  14128.08
6161901            62040      0000008124,85                 2   8124.85

[10039 rows x 4 columns]

In [41]:
df_centro.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

C:\Users\014207631\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [42]:
df_sudeste = pd.read_csv("RAIS_VINC_PUB_MG_ES_RJ.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [45]:
df_sudeste

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   41204      0000000000,00                 1
1                   41204      0000001749,00                 1
2                   46231      0000001331,76                 1
3                   49302      0000000946,30                 1
4                   15106      0000000845,61                 1
...                   ...                ...               ...
13558496            64620      0000002149,21                 2
13558497            85139      0000003604,79                 2
13558498            85139      0000002768,96                 2
13558499            82113      0000008707,37                 2
13558500            85937      0000003599,02                 2

[13558501 rows x 3 columns]

In [47]:
df_sudeste=df_sudeste.loc[df_sudeste['CNAE 2.0 Classe']==62040]
df_sudeste['valor'] = df_sudeste['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sudeste.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

C:\Users\014207~1\AppData\Local\Temp/ipykernel_9840/2439737074.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sudeste['valor'] = df_sudeste['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )
C:\Users\014207631\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [48]:
df_sudeste

          Sexo Trabalhador     valor
62087                    1   1132.11
88384                    1   4823.58
115335                   1   1849.24
222516                   1   1214.24
226088                   1   1601.14
...                    ...       ...
13551437                 2   1606.18
13551724                 2   8138.73
13551981                 2  15092.60
13553578                 2  15839.67
13553819                 2   9852.68

[25362 rows x 2 columns]

In [49]:
df_sp = pd.read_csv("RAIS_VINC_PUB_SP.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [50]:
df_sp

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   81214      0000001141,23                 1
1                   41204      0000002252,42                 1
2                   56112      0000001109,85                 1
3                   43134      0000001317,67                 1
4                   38114      0000001996,51                 1
...                   ...                ...               ...
18888458            85333      0000006612,52                 2
18888459            69206      0000002254,89                 2
18888460            69206      0000003130,23                 2
18888461            11135      0000002044,61                 2
18888462            85139      0000007943,63                 2

[18888463 rows x 3 columns]

In [51]:
df_sp=df_sp.loc[df_sp['CNAE 2.0 Classe']==62040]
df_sp['valor'] = df_sp['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sp.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

C:\Users\014207~1\AppData\Local\Temp/ipykernel_9840/2020413705.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sp['valor'] = df_sp['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )
C:\Users\014207631\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [52]:
df_sp

          Sexo Trabalhador    valor
825                      1  1470.00
1110                     1   543.90
2727                     1   636.95
6538                     1   756.00
51355                    1  3539.08
...                    ...      ...
18886708                 2  9103.69
18886710                 2  4910.48
18887034                 2  8936.17
18887574                 2  8008.12
18887878                 2  2875.97

[50271 rows x 2 columns]

In [53]:
df_sul = pd.read_csv("RAIS_VINC_PUB_SUL.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [54]:
df_sul

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   81290      0000001413,94                 1
1                   35140      0000001353,08                 1
2                   43991      0000001274,25                 1
3                   23427      0000000782,87                 1
4                   45307      0000000000,00                 1
...                   ...                ...               ...
12161305            47717      0000003534,87                 2
12161306            49302      0000002959,74                 2
12161307            87115      0000001565,32                 2
12161308            85996      0000001982,12                 2
12161309            85201      0000003359,37                 2

[12161310 rows x 3 columns]

In [55]:
df_sul=df_sul.loc[df_sul['CNAE 2.0 Classe']==62040]
df_sul['valor'] = df_sul['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sul.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

C:\Users\014207~1\AppData\Local\Temp/ipykernel_9840/3209711941.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sul['valor'] = df_sul['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )
C:\Users\014207631\Anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [56]:
df_sul

          Sexo Trabalhador    valor
61903                    1   511.77
212568                   1  1482.50
217369                   1   570.29
218837                   1   653.14
269437                   1   663.22
...                    ...      ...
12161202                 2  8887.34
12161204                 2  8013.13
12161205                 2  8099.50
12161206                 2  8820.78
12161227                 2  7034.99

[12969 rows x 2 columns]

In [72]:
df=df_nordeste

In [71]:
df_nordeste.shape

(23174, 2)

In [75]:
df_norte.shape

(1581, 2)

In [73]:
df = df.append(df_norte)

In [74]:
df.shape

(24755, 2)

In [76]:
df = df.append(df_sp)

In [77]:
df.shape

(75026, 2)

In [78]:
df= df.append(df_centro)

In [79]:
df.shape

(85065, 2)

In [81]:
df = df.append(df_sudeste)

In [82]:
df.shape

(110427, 2)

In [83]:
df=df.append(df_sul)

In [84]:
df.shape

(123396, 2)

In [109]:
df['valor3'] = round(df['valor'],0)

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 123396 entries, 13505 to 12161227
Data columns (total 3 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Sexo Trabalhador  123396 non-null  int64
 1   valor             123396 non-null  float64
 2   valor2            123396 non-null  float64
dtypes: float64(2), int64(1)
memory usage: 3.8 MB

In [114]:
result=df.groupby('Sexo Trabalhador')['valor'].mean()

In [115]:
result

Sexo Trabalhador
1    5993.280567
2    4184.306132
Name: valor, dtype: float64

In [116]:
result2 = result.to_frame()

In [117]:
result2.iloc[0]-result2.iloc[1]

valor    1808.974435
dtype: float64

In [119]:
print(df.shape[0])
print(df_sul.shape[0])
print(df_sudeste.shape[0])
print(df_norte.shape[0])
print(df_nordeste.shape[0])
print(df_centro.shape[0])
print(df_sp.shape[0])

123396
12969
25362
1581
23174
10039
50271